{
  "1": {
    "plaintexts": [
      "IN THE COURSE OF STUDYING CLASSICAL CIPHERS WE RAN EXTENSIVE EXPERIMENTS WITH COLUMNAR TRANSPOSITIONS AND POLYBIUS FRACTIONATION. THE GOAL WAS TO EVALUATE RECOVERY RATES WHEN MULTIPLE MESSAGES SHARE THE SAME TRANSPOSITION KEY AND TO MEASURE HOW HILL-CLIMBING STRATEGIES PERFORM ON REALISTIC LENGTHS.",
      "THIS TEST MESSAGE IS INTENTIONALLY LONGER AND INCLUDES VARIED PHRASES TO STRESS THE BREAKER: IT CONTAINS REDUNDANCIES, COMMON WORDS, AND REPETITIONS THAT SHOULD HELP INDEX-OF-COINCIDENCE BASED SCORING. THE MESSAGE ALSO MIMICS NATURAL LANGUAGE STRUCTURE SO THE POLYBIUS MAPPING YIELDS REALISTIC FRACTIONATED STREAMS.",
      "ANOTHER LONG PLAINTEXT IS PROVIDED TO ENSURE THE ALGORITHM SEES DIFFERENT CONTEXTS. IT TALKS ABOUT ALGORITHMIC BEHAVIOUR, RANDOM RESTARTS, AND HEURISTIC SEARCH. REPEATED PATTERNS LIKE THE WORD 'THE' OR COMMON SEQUENCES WILL INFLUENCE BIGRAM AND TETRAGRAM STATISTICS AND THEREBY AID KEY RECOVERY.",
      "TO FURTHER DIVERSIFY THE DATA SET THIS EXAMPLE INCLUDES A MIX OF SHORT AND LONG SENTENCES, SOME REPETITION, AND SOME UNIQUE PHRASES. THE INTENT IS TO PRODUCE A FRAGMENTED YET CORRELATED FRACTIONATED STREAM ACROSS MESSAGES WHICH IS TYPICAL FOR PRACTICAL ADFGVX USAGE IN EXERCISES.",
      "FINALLY THIS MESSAGE CLOSES THE TEST SUITE WITH A COMPREHENSIVE PARAGRAPH THAT MENTIONS CRYPTOGRAPHIC ANALYSIS, IMPLEMENTATION DETAILS, AND THE IMPORTANCE OF ROBUST SCORING FUNCTIONS. THE LENGTH ENSURES SUFFICIENT STATISTICAL SIGNAL FOR THE HILL-CLIMBER AND OPTIONAL ANNEALING STAGE."
    ],
    "ciphertexts": [
      "FD FA XF FF AF FD AX VV FV VA DF FF DX AA FA GX FX FF DD VD DF DD XF XD AV FF VA AA XD DD DF DD AG AA VV XX AA XV VV FF VF FV DG AF FG VD AD DF FA FG GA FD FG DD FG FF GF FF AG AD AF DF GG GG AA AF AD FG DA AG AG GA AF DF AF FA FF DA FF GG DF AF FD GD DG DV FV AG DX AD FV VD XD GX XV AD FA XD GF FD GA FX DD FD AX AV XD VG AD VD XG AA VD VV AX AA FV DD VF DD XF FA DA AX XD DA FD DD DF GA GD AG AA DG FA AD AA FG DA GA FG GD GA DD AA FG FA AA FA AF FF AG AG DA GD GF DA GF FG FV AF GA GD DA DF AA AF FA DD AG DF XF DA AD FX GX VD DA VG FD VD XD DD FD DD FA AD FD FD FV DG FV FV XV DA DX VD AD DA VD GF FV DF DX FF FA DD DF GX AX XD XA AF AG AG AF DG AD AG AG FG GF AG GF FF AF DF AF VG FG FD GD DG AD GA GV GG FD FF GA DA AF FG GD DA GA GD DD DD GA DG FF FA GA FD",
      "DA AV DF DD FX XA DF XV DV DA DD AD XV FF DA GG FA AD XD XV DD DA FD GG FF FV VA AX AV AA XA FD FX DD AF FA DF AA GD FG VF FX DD VD DD AF GA DA DA VF FA AA GD FA GG AG AA FA GF AF FA FF FG AF DF GG FA DF GA FA AA AF FD AA AF FG GA AG AF GA GF VG AD VD FD GA AF GG AG DD DA AA DD DX FV DD FA XG XV FX AV VV DD FX FD FF AV GD VD FA DD XV FV XF FD AV FF DA AV AF FD XX AA DF XF VX FA GA VA DA FD FD GX AG GG AA DF FF DD DA DD AA AD GG GG DF DD FA GA AA GF FF AF AG FD GG DF AF FA AA GG FD AG DD FD FG DF AG GG GD FA GF FD AA DD FG FA GA FV AA VF VF DA DX GF GG FG DA AV DA DX FD DV DD VF FF AG GF FD DF GX DX FD GF DG FD DV DD FA AD DD FV XD VD GA FD FA XX XD XF FD AV AD GG GD GG GF DF AF FG GF AF AF FG AA AG FD FG AD AF GA FA GD GA DD AD AA DD FA AA DG FG AG DA AF DD DG AF FA DD FF DA GA GA AD AA FF",
      "DD XD XD XA FG DD XD XX DV GX VF DD DX DF XX DF DF XD AA XD DX DA XX VV DV AV DF DF FF VV VF FX DA XD DX XA DD AG VA FV VG AF AF FD AD FD AA GG AF GG GA FG FG DA GF AF GD AG GA FA AG AG GA AD FG FG FD GG AA AF GG AG DA AA DF AG DF AG AF DA AD FF FX DD XA DD DG GV FA VV AF AV FV DF VA DV AD AF AA DF XG XD DD VF FV FV DG DX XV VX DX AD VD AX DF FF DD VD DD FF DD XA GA FV XA GF FD FG GF AG FF DD FD AA AA AG GG DA GD FD AD DF FF GF AD FG GF FA AA AG DD FG FF FA AA DD DF AF AG FF GG GG AA AD AA GV FV FG FV FX FG VF DD FD AA XX DD XF DA FD FD FV GF DF VD AG FA FD DG DG DD FD VG VF AA FF VX XV VA AG DA AD AF DD VD VX FX XF DD DA GG FG AF GA AD DF AD AF FA GG DA GD DF AA FF AF GG FA DD AA AA AG FD AA FD FF FF FG DF GA DA FA AA GD DA GF VA VA AX",
      "DF DG VF DG DD FX GF XV AF DD GD VV VF XV DD GA DF DA DF VF FF FX AD GD XX VX DD VD DF AV DA FF AF XG FF DA FA DV FA AG FG GV AG AD AF AA AA GG FF FG GA GA FD FF FG FF AG AG GG FG AA AA AF AG AA FG GA AF FG AD DG DD FA DD AG AD GA AX FX VF XX DD AD AD XD FA FX FD XA DD AA VD FD AV FV XV DD DA GG VX AD AF XD GD FD GX AX AA AV FA GD FX DD GG AV VX AX GG DA AD GA AG DG FD DA FF DG AF AA AF FA GF AF FG DG GD AD FF AA DF AG FD AF GF AG AA GA AG DD VA AF AA AD GD FA DG XD XG AA VD VD VA VF GD XA XD FA DF AV GF FD FF VG DA VD DD XF DD VV VF VD XF FD AV DF AA VD DD FX XD FX XX DF XF VX FF AD FA DA GG GA DF GG DA FA DD FF GF AG DA GA DA FA DF FG FA AF FG VA FA AA DA AF FF GG DG AG FA FF GA AG GA AF GX",
      "XD AF VD FA DD DF VD FX VF GD DD DD FF GA GF DA FX VD FV FD DF FD VX FA XA DF AV DD AV FF VA DD DF DF DF FA XG DD DV FA AF DD FG AF GA GG AG AF DG AF FD AA DG VF AD FV GF FG DA AG AA FG AA AG FF GG FD AG FF GA DG AG AG FA GD DD AF FF DF DD AX FX DA AA XV DV AD FD AV DG DA GD AD DX DX DD XF AV DD DD XD DA XD FF AF FX FF DX AV FA XF DD FF XA XX VX XA DF FD DD DD VA AV DA AA GG GG DG DF FA DF AA GG FF AF DF AA GD DA AF AD AG DF AA FG GF DF DG AF DG AG DA GG GA DA FD DA FF AG FA AD GD DX DA AV FA VA FV DF GD AV XX DD VF AA FD FD AA GA DF GD AG VG DF XA DF DF DD DV DD XA XF DD AF AD XD DX FV DG FX DX AD XD DG GG DD AD AG GD AF AF GA DF DF GF FG FD AD DF AF GF GD FD FF FF FG AD AA FG DD AG GA AF GD DD DD FA DD AA FD AF AF GA"
    ],
    "key": "MATHES",
    "lengths": [
      5,
      6,
      7,
      8,
      9,
      10
    ],
    "alphabet": "BACDEFGHIJKLMNOPQRSTUVWXYZ0123456789",
    "results": []
  },
  "2": {
    "plaintexts": [
      "IN THE COURSE OF STUDYING CLASSICAL CIPHERS WE RAN EXTENSIVE EXPERIMENTS WITH COLUMNAR TRANSPOSITIONS AND POLYBIUS FRACTIONATION. THE GOAL WAS TO EVALUATE RECOVERY RATES WHEN MULTIPLE MESSAGES SHARE THE SAME TRANSPOSITION KEY AND TO MEASURE HOW HILL-CLIMBING STRATEGIES PERFORM ON REALISTIC LENGTHS.",
      "THIS TEST MESSAGE IS INTENTIONALLY LONGER AND INCLUDES VARIED PHRASES TO STRESS THE BREAKER: IT CONTAINS REDUNDANCIES, COMMON WORDS, AND REPETITIONS THAT SHOULD HELP INDEX-OF-COINCIDENCE BASED SCORING. THE MESSAGE ALSO MIMICS NATURAL LANGUAGE STRUCTURE SO THE POLYBIUS MAPPING YIELDS REALISTIC FRACTIONATED STREAMS.",
      "ANOTHER LONG PLAINTEXT IS PROVIDED TO ENSURE THE ALGORITHM SEES DIFFERENT CONTEXTS. IT TALKS ABOUT ALGORITHMIC BEHAVIOUR, RANDOM RESTARTS, AND HEURISTIC SEARCH. REPEATED PATTERNS LIKE THE WORD 'THE' OR COMMON SEQUENCES WILL INFLUENCE BIGRAM AND TETRAGRAM STATISTICS AND THEREBY AID KEY RECOVERY.",
      "TO FURTHER DIVERSIFY THE DATA SET THIS EXAMPLE INCLUDES A MIX OF SHORT AND LONG SENTENCES, SOME REPETITION, AND SOME UNIQUE PHRASES. THE INTENT IS TO PRODUCE A FRAGMENTED YET CORRELATED FRACTIONATED STREAM ACROSS MESSAGES WHICH IS TYPICAL FOR PRACTICAL ADFGVX USAGE IN EXERCISES.",
      "FINALLY THIS MESSAGE CLOSES THE TEST SUITE WITH A COMPREHENSIVE PARAGRAPH THAT MENTIONS CRYPTOGRAPHIC ANALYSIS, IMPLEMENTATION DETAILS, AND THE IMPORTANCE OF ROBUST SCORING FUNCTIONS. THE LENGTH ENSURES SUFFICIENT STATISTICAL SIGNAL FOR THE HILL-CLIMBER AND OPTIONAL ANNEALING STAGE.",
      "AS PART OF A LARGER EVALUATION WE PRODUCED SEVERAL LONG PARAGRAPHS INTENDED TO STRESS THE TRANSPOSITION BREAKER. THESE TEXTS CONTAIN REPETITIONS, COMMON PHRASES, AND NATURAL LANGUAGE PATTERNS SO THAT BIGRAM AND TETRAGRAM STATISTICS ARE REALISTIC FOR THE POLYBIUS MAPPING.",
      "TO ANALYSE ROBUSTNESS AGAINST LOCAL OPTIMA WE COMPOSED MESSAGES WITH VARIED REPETITION LEVELS AND SYNTACTIC STRUCTURES. THIS ALLOWS RANDOM RESTARTS AND ANNEALING PROCEDURES TO BE TESTED AGAINST BOTH HIGHLY REDUNDANT AND HIGHLY DIVERSE STREAMS.",
      "MULTIPLE SHORTER MESSAGES WERE MIXED WITH LONGER ONES TO AVOID ALIGNMENT BIASES AND TO PROVIDE INDEPENDENT SAMPLES FOR EACH COLUMN. THE MIX OF LENGTHS HELPS REDUCE PADDING ARTIFACTS AND GIVES A MORE STABLE INDEX-OF-COINCIDENCE SIGNAL ACROSS CANDIDATE KEYS.",
      "EXPERIMENTS INCLUDED TEXTS THAT EMPHASISE COMMON STOPWORDS, NUMERIC PHRASES AND DOMAIN-PECULIAR VOCABULARY SO THAT THE SCORE FUNCTION FAVOURS TRULY LINGUISTIC STRUCTURE RATHER THAN ARTIFACTS ARISING FROM THE FRACTIONATION.",
      "WE ALSO GENERATED MESSAGES WITH BLOCK-ORIENTED PATTERNS TO SIMULATE SITUATIONS WHERE SOME COLUMNS SHARE SIMILAR CONTENT. THESE BLOCKED SEQUENCES ALLOW TESTS OF BLOCK-RECONSTRUCTION STRATEGIES AND HELP MEASURE HOW MANY SAMPLES PER COLUMN ARE NEEDED FOR RELIABLE RECOVERY.",
      "FOR REPRODUCIBILITY AND DIAGNOSTICS EACH MESSAGE VARIATION IS TAGGED IN THE EXPERIMENT LOGS; THIS MAKES IT EASY TO REPLAY SEED GENERATION, CONTROL RNG SEEDS, AND INVESTIGATE WHY PARTICULAR CANDIDATES REACHED OR FAILED THE IC THRESHOLD."
    ],
    "ciphertexts": [
      "AX VA AV AD DF FX DF GX GA AF GX AG AF GA FF DF DF GV AV FG GF FD GD VV AA GA DA GA GX GV AD DX AD FF GF FA FV FV FD FA GG AV DD AD DD FA AF FX GD AD FA GD GA AV FA DF FD DX FG FF GV FF GD FA FA GD AD GF FD DV AD FF FF GV AX VG FD VG XG FG DG DD FF XF AD FF VG DA VF XD FA FF FG AD DG GF DG GD DD AF VA FA XD FF AD DA DF FA AD FA AA GA AX GA AD FF VF AF DF AA DF DG AA GG AF AA FD AG XA XG VG DF FF FF VA DA FD XG XG AG DA DG FG VD GA DF FF DA XA XD DV AD VF VA DF FA FA DA AF VG AF VA VA DV FF AA AD DA VF XA FG FD FF VG AA DG DF XG VF DG FG GD AV FF GF DF FX DF GD GV FD AX DA GF AA AA GG FG AF FD FX AF GF AX GX GF FA DA AA GD FG XA XA FD XA GV FF VA FA VG AG AG FF AF FG FG AA VG VG XF FV FF VA GG FD DG FG VD DF DD FD GF GF FD GF FD GF GV GA GF AA GA DD AX GD",
      "GA AD AX AA GV AG FA AF AF AG DV DX GV VG GF FV GA AX FV DA AD FF FG FD AF AF AA GD AD AA GX AA GF FA AA FD FF AF GX FF FF AX GF GA DD GA DF AX DV FF FA AD DX FF FF GD DD FA AF GX GA AF FF GF AA GX GG FF AF GD FD AA FF DF FX FF FF AD AD GA DD DD GG XF XF VA VA DA DF DA AF DA FA AA XD GX AA FF DF AG FG AD XA DA VA AD FF XD AF FD AA DX AA GX AG GX AF AV FV GA AD GF GA AA GV FF AF GX FG DD FA GG VG AD FA FD GF FF AG DF XG FD VF DG DG DD XA GF DA DF AF DG XD DD VD AG DF DF XV FF AG VV DG DG DD XA DF FF FA VF VF FD AD AV FG VX DG FD FA VG VG DF GG DD XA VG AA FA XD GA DF XX FA FA DF GA AF AF GD GD FG AD AF DV AX FG AF AX GF FD DX AA DD FF AV DG GF AA DA GA FF FX GF FX VA DF FG FA VF GG FF AD GD FF AA AG DF AA FG AX DA FG VA VG DF FG AG FG VV VG DG FD AG AA AD DG GV AF FF GV GD AA FG GX AF GD GF FF AG GV GD GX",
      "GF AG GX AX GV DF FV AF AF DG FD FD GA DX VA GG AV AX AD AD AD FF AV GV DV GA AX FF FA DX DX GG GF AF GF GF AX FF GX AF AV AF GD AF FX FD GF AA AV GA FD FA DF FD AD FF VF AA GV FX FA GG FF GD GF FV GD AA AD GD FV DA GD GD AX DG AG DG FF DA DG GG XF DF VF VA VF FA GA FX XF XA VF DG FG AF AG AD GD FF AD FF XG DD VX AF FD DD VF GA DG FD AX AD GX FF FA DF GF GX FF DA XF AG AA XD FG VA VA DA DG XF DG FV VX DD XA AF VF DG FA XG DG GG VD FA DD VG AA XX DD FA VA GD FF FG DF AG FF DF AG AG XG DG FX XG FF FG VA XD FA XF DF GA XF VA VA FA VA XX FD GD DA FV DX DA AD AX GF AA FF AG FF FV VX DD FV GA AD DF AF FF GD FX FF AX AD GD AV FX VA GF DD DF DG DA FG FD VG VD VD DG AG DA GX FF VA AD VA XG AA XG GD VG VG AD DA DG FA AX FF FF AD VD GD FF FA GF AA FF AX DF FA DG AX",
      "GX VA GX FD GA AA DV GV GX FD GA DF DD AA AG AD DV DF DV GD GD FX VX GA FA GD DX GX FV AD AA FD AG FF AV FF AF AD GV GF GA AX FG GV FA VG AV FV FF FF AX GV DA DF GA FV VF DD FG GX FX FA GD FD AV DG FF AX AG AA XF GA VG FD VA DF VF FD VG FF AG DF FG VX DA DA DA DA AA AA DA AA FA DG AD GF FD FX GX GF AF FA GV AV GD AA GD FX GA VX DA FX DG DG GA AF DA DF FG GF GD FG XD FV FG VX FA DG AA DD VF FA XF FV VA FA FG DD DG DG AA VD XG DF FF FA AA XG AG DG FA AF FA XX VV FG FG FF FG FF DG FF FV FF VA FG GA FX FD GX DX FD FD FG AA AD FD GA GF DF VV GX AF GV DF GV FF FV DF DV FG GF AD AX AA AX DG FG FF XG AG GA AG GF DA FA AG AF XG XX DA AA FA FA DA FA DA DG DF XA FG FG FD FA DA GA FA GA GD GA GD AA DV FV FV FG GF DX",
      "VD AD GF AX AX DA AG AX FX AV FF AF DF FD GG AF VA XF DA DG FG FA DG AG DG DA FA VF FA DV GA GV GD FF FA GF AF GD GD AD DX DX FX XA FD VA AG FF AA FF VG DA FF DA FG AA AG DG FA DD GG AG GG DA GD DF AD FA GV GD DD AV DX GA GD DF DF DD FD DF AD AD AA GF VX GD AX AG AA FF FG AG XA FG GV FD VG DG XF FA XD XD AA DD DF DF AG GA XF VG AD VV AG DD FG FX DF XA VF VD DG FA DG DF AD DG AF DG DA FG AF GF GV FG FD FF GD GD GD FF DV AA FV AD AF FA FG FA GG FF FF FA VD AV AD AG FD FF FD VD DD AF GA FF FA FD FF FF GX AF GA GX FF GX DA DF FA FA FG GA AD FX FD AA DD AD AF FA XG FG AD DD DD FV VF FF DF FD AA FG XD GG AX XG VG DA XG DF FD FG AF AF DF DG FF XF FF XD AV AD FF GV VD AV AG GF AF FX AF DD FG FD VA GA GV GF GX DX FA FF DD AD VD DF DD DD X",
      "GF GV AX FV FX AV GF AF GF AA DV GA GD GG XG XG AD VG AA DD VG DF FG DF FA VD FF FA GF AG GG GG FV FG DX GD GD GA GX VX FG XD VG FG DA FF XG DF DF XF AF DG FG VF FF AG AD FG GD FD GX FG AX GF GX GX AG GX AD AV GA GD FX GF AF GF DD GF FA AD VG FA FD FG DG VA FG DA AA AG XA GF FD XA DG VA GF FA DD FA AF VF FG AA FF XG VF AA GF AF VD GA AG DD AA DD GG FG FG DA FF FA GX FA FF AV FF GD FF FD DG FX FF FD FA FD FF GF DA AF DA FF AF DF DD AD FF FD GD GD AX DD GD GV AF GA GX DD AD GF AD AA GG GV DA AD FD AV AD FA GA GF AA GF DA XV VF FD FG AG FD DG FF VF FF DG AD XG FD DF FA XF FF DG VA DG FG DA VG DG DG FA FF DF AG FX FX GF FX FF FF DV GA GD GA AA FX FA GX FF AA GV GD FA AA FD AF AF FD F",
      "GV GD AG GG AV VA GF FF AG GF DG AF AF DD FG VG FG XG AA XG FF VG AD GD XG GA GF AG GV AA DF GF GD FA AD DF DA XF XG XF FD FG GF DG VA DF AA FA AD GG GF GF GA AX AV GX DA GG DX GD DD AV FF GF DV FV AF GF GA FF FX GV AX FD AX AF DF FG DA DA FF XF DG FA FG XG AG XD AA XD AA GF FG DG DF DF DA DV DD VX FA FD FA VA FD DA DF AG AA AG AA FF AF FA FA GA FD AD FD GV AD FV FF FD AF DA AG VA AA DG FD FG DF GG DG DG AG AA AA GA GD FX GF AX FA DV AA DV FG FX AV GD FA GG AA GV FA GX AV GD AD AX XG DG GF AD VD GD XD FG FA DD DA FA DX XG FF FA FF FF DA FA XA FF GF AG XG XD FA DF FF GV GA GA GX FF AD AD AG GV VD FF FV GX FD AA DG GV DF GF FD VA X",
      "FA GX GF AV GG AA GD DV AF GF DD FX FV GX DF FA DD GV AV DV DA AF DX FF GX AX AD AX FD AF FF FA FA GX AD AV AD AF GX AD GV DD AD FF FG DD AX FX FA AF DF AA DF GA DV GD AG AX DD FG GD AF AF AF AA FA VA DF FG FF DV FA DA GG FG GD FG FX XF VG VG DA XA AF AF AA DG VG XA DD VX FV GV DF DF FD GD DF DV AF GA AF DA GX XF FA XG FA GA GA DA DG FA GF FA VF FX AF AF DA GG DA DD FD VF GG DF VF FD GG DG AG FG XA DA VG FF AF GV AA DF AF GX VA VA XF AG FF FA AV DD AG AA FA FG VX GV FF FF AA GG FV FD AF GA GD VV DF AX AA AV FG FV FV GX FF DA DD GF FG GF DX GF AA AG AG GA DF XG DA FD GG VA AG DX AD AA DF FF FA VF FG XD VF FF XD DG DV DX GG AF FA FG GF AX GG FF AD GF FA AX",
      "AD AD AD GG AV DA GF AX DX DF FV GA FA VD FF FF XA DF FG AF FG AF FF FD GA FG AA GF DF AD FA AD FF FF FG DA FG AF DA FG FD DF FG VG FD DG FA GD AD AX FA AD FF GD GX FD VX AX DX FF GV AF GX GV VX AA DX FF GD AA AG AF FG DG XD AG XG DF FG DF XA FG GF VF VA FG DV DA FD DG XF DX GA DA VF AG FD DD FF AD DG DG DG FX GG GA GD FG AF GF AX FA FF GA FD VF VF FF AG AA AG XF DA XG FG XD FV AD GF AF FG FA AD FA AA GD AD FX FG DA FG FD AF GV DF DF FD GF AD XA AG FF XD FF GV DF GV DA XV AD FX FD DD AF XG FF FG DG AG FA DA AA XV GV GF GA DG DF FA GA AF AD DD VF FX GD FF AA FX FD AF DA GV AF GF X",
      "GD GD AD AF GV DX GF AF AF FA DV GX AF AA DF DX GX DF FX AF AV AV DD GA AV DX AV DX GD AF AD GD AA GF GG GA DX FF GA AA AX FX AV GD AD FD DF GF GF FV DD FF FD FF FX FX GX GD FV AA AF FX DV DD FA GV FF FF AX AX AA VD VG FA VF AF AG AG VA XF FG VF GA FX AF VF GF VF FG AA DF XF VG DD AV GG GA VX FV GF AA GF GA AD AA GD FA GD GF GA AF GX FG FD DF AG VD XD DA FA FG AG AG GD VA VX VF AA VA AA DF FF DD DG XG DA GF AF DF XX XG AF DF XG XA VF VA VG FF DG VF XA VD FX VA FF FG AG AG FF XA XV FA VA XG VF DD XX FV GX GA AA AA DD FA FD FF DV AA FX FX VX AA AF GF GD FA AV DV DF DD AD FA AF VD FX FA AD GG DF AF FG VA FG XD FA AF AF VG GX VA AD FG FG VD DG DD VG DF FA XD FD VF VX DG GV FD AF FD FD AV DA AF GG AD FD AF AX",
      "VG VD DV FG AF DA GX GV GV DG GF DX FF AD AX GD FD AX AF DA GA GF AV FX AD AF GF GD AD GV DF FF AG FD AG AX FA GF DG AF FA AD AF FV AV AF DF GG FF FA FF GD AA GF AD FG GD DG DX DX VA GD AG FA VA DF AF XF FG XA GG VX XA FA FA AG DF FG DF AA FG FF XA DX FF AF GF DV FF AG AD FD DF DV FD GX XA DG AF AG FG AF VA FG AV XG DA DX FD FG DG FF XG VF VG XA VD AA FD DX XA GA VA DD AD FA GF XG DF FG VA XX FG AG AF VF XG AV VF AF DA DA DA FX AD FF AF AG FF VA FD AD AF AV GF DX FF DV DF AX DA GF AF GF GD FX VV FX GD FG AG AA DG VD VD DA AF FG FD AX DA AF FG DA VD VG AG DA GG FA FA FA FX GA GD DV GA GX FF DG GX GA FD DX"
    ],
    "key": "AVENIMANAILUYISPR",
    "lengths": [
      17
    ],
    "alphabet": "UBIDEZGHCJKLMNOPQRSTAVWXYF0123456789",
    "results": [
      {
        "length": 13,
        "key": "MKGEAIBHFJDLC",
        "alphabet": "UBIDEZGHCJKLMNOPQRSTAVWXYF0123456789",
        "score": -14.043607570270064,
        "recovered_plaintexts": [
          "INTHECOURSEOFSTUDYINGCLASSICALCIPHERSWERANEXTENSIVEEXPERIMENTSWITHCOLUMNARTRANSPOSITIONSANDPOLYBIUSFRACTIONATIONTHEGOALWASTOEVALUATERECOVERYRATESWHENMULTIPLEMESSAGESSHARETHESAMETRANSPOSITIONKEYANDTOMEASUREHOWHILLCLIMBINGSTRATEGIESPERFORMONREALISTICLENGTHS",
          "THISTESTMESSAGEISINTENTIONALLYLONGERANDINCLUDESVARIEDPHRASESTOSTRESSTHEBREAKERITCONTAINSREDUNDANCIESCOMMONWORDSANDREPETITIONSTHATSHOULDHELPINDEXOFCOINCIDENCEBASEDSCORINGTHEMESSAGEALSOMIMICSNATURALLANGUAGESTRUCTURESOTHEPOLYBIUSMAPPINGYIELDSREALISTICFRACTIONATEDSTREAMS",
          "ANOTHERLONGPLAINTEXTISPROVIDEDTOENSURETHEALGORITHMSEESDIFFERENTCONTEXTSITTALKSABOUTALGORITHMICBEHAVIOURRANDOMRESTARTSANDHEURISTICSEARCHREPEATEDPATTERNSLIKETHEWORDTHEORCOMMONSEQUENCESWILLINFLUENCEBIGRAMANDTETRAGRAMSTATISTICSANDTHEREBYAIDKEYRECOVERY",
          "TOFURTHERDIVERSIFYTHEDATASETTHISEXAMPLEINCLUDESAMIXOFSHORTANDLONGSENTENCESSOMEREPETITIONANDSOMEUNIQUEPHRASESTHEINTENTISTOPRODUCEAFRAGMENTEDYETCORRELATEDFRACTIONATEDSTREAMACROSSMESSAGESWHICHISTYPICALFORPRACTICALADFGVXUSAGEINEXERCISES",
          "FINALLYTHISMESSAGECLOSESTHETESTSUITEWITHACOMPREHENSIVEPARAGRAPHTHATMENTIONSCRYPTOGRAPHICANALYSISIMPLEMENTATIONDETAILSANDTHEIMPORTANCEOFROBUSTSCORINGFUNCTIONSTHELENGTHENSURESSUFFICIENTSTATISTICALSIGNALFORTHEHILLCLIMBERANDOPTIONALANNEALINGSTAGE"
        ]
      }
    ]
  },
  "3": {
    "plaintexts": [
      "Dein Laecheln traegt die Waerme des Morgens in sich. Wenn du sprichst, verwandelt sich jede Stille in Musik. Du bist das Licht, das selbst an dunklen Tagen bleibt, das Herz still beruehrt und die Welt in sanfte Farben taucht.",
      "In deinen Augen liegt eine Ruhe, die mich traegt, wenn alles andere vergeht. Sie sind wie klare Sterne in einer endlosen Nacht. Ich verliere mich in ihnen und finde jedes Mal ein neues Zuhause fuer meine Seele.",
      "Mit dir fuehlt sich jeder Moment nach Heimat an. Kein Ort kann so echt sein wie deine Naehe, kein Traum so lebendig wie dein Blick. In dir finde ich Frieden, Staerke und dieses seltene Gefuehl, ganz angekommen zu sein.",
      "Deine Stimme klingt wie Wind durch die Baeume, sanft und doch stark. In deinem Lachen wohnt ein ganzer Sommer, der nicht vergeht. Ich trage deine Worte in mir, als waeren sie geschrieben in das Herz der Zeit.",
      "dein Name klingt wie ein Gedicht aus Licht und Leben. Du bist kein Traum, der vergeht, sondern Wirklichkeit, die bleibt. In dir beginnt jeder neue Tag mit Hoffnung, Liebe und dem Wunsch, ewig bei dir zu sein."
    ],
    "ciphertexts": [
      "AX GF DF AG AG GD DX AV AF FX FV FA GD DX AV AD GD FX DF FD FD GF AF GD GF AF AX AD GX GF AV GF AV AX DV VD AF FF FF AD GF AD AX AD AX AD AA AD DA AA DX AA FX GD XA AG DG AD GD AG DD AF DX DD AD GX DV AD FA GD AF GX GV AA AG AX AF GD AX FD AX FF VA VG XG FD XA FG XG FX VG FD VD VG AG VD VG DD DG DG XF DG DA VA DF DA DA XX DV FF AD AA AA FD FA GD DX VA AD XF VF DG AA VA VG AX VG GF AF FA DG FD FA GG DX DG GA FV DF GG AV DV AD GX DA AA GG GF AG GF DF FV FX FD VA GA FD AD DG GD DG VX GF VF DD GA AG AD XA VA VD AA AF AV DX AD GF GX AA FX FA VG AG DA FA DA AA GF DX",
      "AA AF FX AF AA GF AA GV AA XD XD VF AA DD DF XD VX AF AF AX AD FF AF AV GF XF VF DG VG XA VA DV AA XX AF AV AA DF FF AA AA AV XA DA DD GA VF DF FA FA AX FA VA VD GA XD FD GA FF XF DA DF DA DA DA VA DA AX FV AV GA GV AF AD AF AD XG DA FX AF GD FX FF DA AX DF XG FG AA FF VA DG XF XV AD GX FD GV GX AD AD AX DD DD FF GD GD DD GV AX XA FF FV AX FF DF FV AA DX VG FG FD FF DG XA GF AG XG VF VA DD VD FF DA VV VX FA AA GG VA XD AA GA DA XD DG DA AV FV DV FV FA AX FA VD DA VF VA GD GF AF VA AA AG VA XF DF DD DG VX DA VG DG VA GA VF VA VA X",
      "FX FD FV AV DV FF GV DX AA FA AG DF DA FF XD AA AA AF FF DA AD FD VF AA AV AA DF VF FA VA GA DA AA FA DV DV FF AA AV AA AD FV XG AF FF DA FA VA DF VV DG FD DG VA VF DA DA VA VD FA VG DF DA AD FA VA DD AX FD GD GV FX AD AV AV DV FD AA FX GF FD AF FX GD DA FG FA FD VA VA GV VA VF AG DV GD GD GV FX AV GA AV DX DF AV DF AF DD AV AD XD FD AF AV FF AF GF AD FX DA DF DF FA FA DA DG XF XA GD VG VD AG FA DA VG AX VA FA AA DG VD VG GF FA XX DD GF AD GG DF AA DD FD AG AA DD GA XA DD FG AG XV GF FF FG FA XF GF XD FX AA FD DG VF AD GF GA AF X",
      "AV AV GF DD FF DD FA AX FF AV AF DD AG FF GA AV AD AA AD AA FV GX GV FX AV FD AX GV FD DV GF AX FV AD GV FX AD AA FF AX AX AF FV DF FD GV DV FG VD AF GA VG XF FG VG DA AV DA DF FX FV AF FD GF GA FA FG FF AX DD GA AX FA GA DA FF AG DF XD DA VD DG AD FA AG DG FA VA DF GA GF DD VA XF AA FF AV AD GA GA DF FF GV FX AG FV DF DG FA FA DA VX DG FG FA VA VA VA VD FA FF AF GD DV FD AD AX DD AA GF AA DF DG VF VA DX AG XA FA DF GD AA FD GA GD FA DF XA FD FA XA DA GD DV DV GD AA AV AF GV FA DG DF FA XD GF XF AG",
      "AF AF FD FX AD FA VA DX FD DD AF DF AD DF FG AA FV DA AA GX AG AA DV DV AD AF AD DD AD FV FD AX DD DD AG AD AA AF AA AX AA AD AX AV GF GD AG GA DA DF FF DD FA VF AF AA AV AX DV FF DD FD AA AX GF GD GA GV AF AA DA AF FG FG AG VA DF DG AA VG VD GD GF AG FA DG DA VA DG FA DA DF GA GD DA FA AA AV FV FV AF AD AF FX XD XA FA VD FA VV VD FX AA FD DA FA DA VG FA VX DF GV AX AF AV FD AD AX VF AA VG GD VD DF DG GX FA DA AA AD VF GA XG DF GF VD DG XF VG DA DF DA FV GG GG FX AX AF AV AD VA AA VF DD XA XD VF FX"
    ],
    "key": "AVENIMANAILUYSIYTTERP",
    "lengths": [
      21
    ],
    "alphabet": "UBIDEZGHCJKLMNOPQRSTAVWXYF0123456789",
    "language": "DE",
    "results": []
  },
  "4": {
    "plaintexts": [
      "IN THE COURSE OF STUDYING CLASSICAL CIPHERS WE RAN EXTENSIVE EXPERIMENTS WITH COLUMNAR TRANSPOSITIONS AND POLYBIUS FRACTIONATION. THE GOAL WAS TO EVALUATE RECOVERY RATES WHEN MULTIPLE MESSAGES SHARE THE SAME TRANSPOSITION KEY AND TO MEASURE HOW HILL-CLIMBING STRATEGIES PERFORM ON REALISTIC LENGTHS.",
      "THIS TEST MESSAGE IS INTENTIONALLY LONGER AND INCLUDES VARIED PHRASES TO STRESS THE BREAKER: IT CONTAINS REDUNDANCIES, COMMON WORDS, AND REPETITIONS THAT SHOULD HELP INDEX-OF-COINCIDENCE BASED SCORING. THE MESSAGE ALSO MIMICS NATURAL LANGUAGE STRUCTURE SO THE POLYBIUS MAPPING YIELDS REALISTIC FRACTIONATED STREAMS.",
      "ANOTHER LONG PLAINTEXT IS PROVIDED TO ENSURE THE ALGORITHM SEES DIFFERENT CONTEXTS. IT TALKS ABOUT ALGORITHMIC BEHAVIOUR, RANDOM RESTARTS, AND HEURISTIC SEARCH. REPEATED PATTERNS LIKE THE WORD 'THE' OR COMMON SEQUENCES WILL INFLUENCE BIGRAM AND TETRAGRAM STATISTICS AND THEREBY AID KEY RECOVERY.",
      "TO FURTHER DIVERSIFY THE DATA SET THIS EXAMPLE INCLUDES A MIX OF SHORT AND LONG SENTENCES, SOME REPETITION, AND SOME UNIQUE PHRASES. THE INTENT IS TO PRODUCE A FRAGMENTED YET CORRELATED FRACTIONATED STREAM ACROSS MESSAGES WHICH IS TYPICAL FOR PRACTICAL ADFGVX USAGE IN EXERCISES.",
      "FINALLY THIS MESSAGE CLOSES THE TEST SUITE WITH A COMPREHENSIVE PARAGRAPH THAT MENTIONS CRYPTOGRAPHIC ANALYSIS, IMPLEMENTATION DETAILS, AND THE IMPORTANCE OF ROBUST SCORING FUNCTIONS. THE LENGTH ENSURES SUFFICIENT STATISTICAL SIGNAL FOR THE HILL-CLIMBER AND OPTIONAL ANNEALING STAGE.",
      "AS PART OF A LARGER EVALUATION WE PRODUCED SEVERAL LONG PARAGRAPHS INTENDED TO STRESS THE TRANSPOSITION BREAKER. THESE TEXTS CONTAIN REPETITIONS, COMMON PHRASES, AND NATURAL LANGUAGE PATTERNS SO THAT BIGRAM AND TETRAGRAM STATISTICS ARE REALISTIC FOR THE POLYBIUS MAPPING.",
      "TO ANALYSE ROBUSTNESS AGAINST LOCAL OPTIMA WE COMPOSED MESSAGES WITH VARIED REPETITION LEVELS AND SYNTACTIC STRUCTURES. THIS ALLOWS RANDOM RESTARTS AND ANNEALING PROCEDURES TO BE TESTED AGAINST BOTH HIGHLY REDUNDANT AND HIGHLY DIVERSE STREAMS.",
      "MULTIPLE SHORTER MESSAGES WERE MIXED WITH LONGER ONES TO AVOID ALIGNMENT BIASES AND TO PROVIDE INDEPENDENT SAMPLES FOR EACH COLUMN. THE MIX OF LENGTHS HELPS REDUCE PADDING ARTIFACTS AND GIVES A MORE STABLE INDEX-OF-COINCIDENCE SIGNAL ACROSS CANDIDATE KEYS.",
      "EXPERIMENTS INCLUDED TEXTS THAT EMPHASISE COMMON STOPWORDS, NUMERIC PHRASES AND DOMAIN-PECULIAR VOCABULARY SO THAT THE SCORE FUNCTION FAVOURS TRULY LINGUISTIC STRUCTURE RATHER THAN ARTIFACTS ARISING FROM THE FRACTIONATION.",
      "WE ALSO GENERATED MESSAGES WITH BLOCK-ORIENTED PATTERNS TO SIMULATE SITUATIONS WHERE SOME COLUMNS SHARE SIMILAR CONTENT. THESE BLOCKED SEQUENCES ALLOW TESTS OF BLOCK-RECONSTRUCTION STRATEGIES AND HELP MEASURE HOW MANY SAMPLES PER COLUMN ARE NEEDED FOR RELIABLE RECOVERY.",
      "FOR REPRODUCIBILITY AND DIAGNOSTICS EACH MESSAGE VARIATION IS TAGGED IN THE EXPERIMENT LOGS; THIS MAKES IT EASY TO REPLAY SEED GENERATION, CONTROL RNG SEEDS, AND INVESTIGATE WHY PARTICULAR CANDIDATES REACHED OR FAILED THE IC THRESHOLD."
    ],
    "ciphertexts": [
      "DV FA FA DA AG AG FG FG GG AF AA XG GA VF AA AX FV GA FX FV GX FA GV GG DF GD AD AV FG VF DG DD FG AA XA AA XF FG DD XG AF AD DV AA FF FD FV AV AD DD GV GF DV FF FV DX FF AF FD AF DV DV AA AA AF DA GD DF AG VG GA FA GG FG FV DA FG DG DF DF FD VG FD VG AF FA DA XA VA VD AA DA XG XD AG FD FG GF XG AA DF GF AF VG GV AD AF XA DD GD GX GD GG FF GA FV FD AF AV AF VX GF AD AF XD DA XG DG VG AG VG FF VA AF DX DF AD XG VD DG FF AG FG FA VF VG XG AF XD DD FF VG AF FG FG FG VD AG FG AD DA VF DG XF DA DF GF AG FD GD XG FG FF FF VG DF AA FD AF FF FF FF GA FV FD AD FA AF GD GF GV GF DX FA AD FX GX GD FD AD FF FF XA AF FA AF FG FA FA FA DG FD DD VA DA FD AG AX AV GX GF DD GD FA GX FF FF AV FA GA AG GA VG AF DV DD XA DA AF AF XD XF FD XA FG DA DF FV DD DF FD AG FF AD FA AA X",
      "FG DF DA AD FF FF GD DV DF VF AD XV FA XA XV AF AA FA FF AF GF GG AD FF AX GF AA AD FX DA FG VF XG DA AF FF DD AG VG FA DF VG FG XD GD VG GA GV FD FX GX GG GV GF AD FG GF GA DA AA AF AA FD DD AA AX AA FA GA AF FA VD XG FF VA GG XF AF AG AA FG DD FD DG AA FA XX DA FD XA FA FA AA DG XF VA AF FG AA AD FG XA AF XF XG DA AA VF DD FF FA FA FF XA XF VX AV FA AG GD FG DG AD FF AF GA DA FF VX GD XF FD FG XA FG GF DF FA FA DG AF AA AD DF FX DG VD FF VG XG FG VG GF VD AF DG AD GF DA XG FG FD FG DG XA FA DA DD FG AF AA AF VG GX AD DF FA DA DA VF VG VD FF AA XA VA DG FG XA GD FG DD AD FF GD DF FF DA DX FD GF GF AX AD DD GF GV AF FG FA AF AD DD DF FF AF GA XG VG XA GG AA FF FF DD VA GA XG AG GF GD FG GA GX AD FV GD FF AD FD GA AF GX DA AA FV XG AA DD VF VD VG XG FD FA XG FG VG DD FD AX AF XF AG VD FG AA FA GA VD FF DD VG XA DF X",
      "FD AF VG XG FA FF AG XG VA AA DF FD VA VF FG AG DG AF FA GG VF VD AA DA DF FG XA FF XA FG FD XG VG DG FF DV AF DG GF FD DA DD DA VF VF XA FF FG FG AF AG VV FA AG DD AV GF DD GF DG DD FA AA FD FA FD GA FA DD GA AV DA GX GF AF AV GD AG DA XF XA DA FD FF DD GA DF VD VG AG AF FG GD AA FX GX GG GA FF AD GV FF GF AX AF FD DV GF AD FX AF AV AX AX AD GF GF FV AX AF FF DF FD AF AA FA DD FX AD DX DF FG DF VG AF DA DG DG VD DG VG XA XF GX FF GA AD AF GF GD AD GV AF DD FF AV DG GA FA VG DG GF FA VG DF VD FA AG DD XG GA FA FG DA AG DA FF VF VF FG FA FA FX AV GD GX DD GF FX AX AA AX GF GD AA GD GV GD VD DA AF FX DG AG FV AF DA AV DD AA FG FD GF FA AV GD FF FD DD GG AV DF FV DV FA FD AA FF FD DF FX AG GA VF FG GA FV DD XA XG AF VD XF FD XG FD VV",
      "DA GG DG DA XG FG DD DF FG FG AF GA VD AF GA GF AV GV AD VG GF AA AF GG GX VV VF VF AG FF DF GG VA DF AD XD AF XD AD DV FD FA FA GV AA FD AF DA FX DF FF AD AA GD AF FA FG AF FV FA GX GA GD FG FA AF VG AF VF DV FF VA FG DG XX XG DG XV XD GA AD AG VD DF AD FD AA XV GA FF FF DF DA VG AF XG GF VV GA VA GA GX AD FF AG AD GF AX AX FD DF GV XF AG GG FG AG AF DF FG VG AG DV FG XX FG VA FA FG VF DA DA VF XA XA DF FA AA VG AD XA VA FF AA FG XD AG AF XV FG AF FA FF GF VF VG FA DA FG AG GG DF AD VA FG DD GD FG AF FA GF GV DF AX AX AD GX GX AF AV GD FA DG GF GF FF GF XG GD DA FG VF FA FA FF FV DD FG FD FA AD AA AD DA AF DF FX AD FF GF DF AV XF XG VD FD DF DA DG VA VG DG VA FD DX XG DD AF AF DA XG XD DA FG AA DG AD X",
      "DA AG FG XF GG AA AF XA FG AG FF XF DD XG DG AA DF AD VA GG AV DF DG FA DF XX DA VG XG DG FG VG DD DF VA FG DA XG DX DG XG DA FF XA AG FF FF DF VF FV XA FG AA FA DV DA VF AF DA VF AD GD DD DG FD VF DD FV GF FX FG GF GD DD AD DV AF AX XG AA FG GA FG XF DG DD AA DG AD AA FX FA GD GD FV FF FD GG FX FA GD GF DF FF DA GF FG DF DF AD AD AA GV VF AD AF DX DV GV AF GA FA FD AF GD DA AA GF GF DX FF FG DF AA AD FG XF DF FD AG FF FF DG GV AA DA GD GF FF GF FF FD AA DX AG AA FG VA FA FG DF GF FF FF DD AG XG FG VA AD DA GF DF XV AA DF AA DG FA AD VF FX AF AF DX GF DF GF AV DF AX AD DX FX GX VF DV GD GD FD GD AF FF GV AV AX DD GA GA AV FG DD GA AV DD GA AA DF FD FD FX DA GA FF FD FD DF FX AD GD VD GD FD GV DD DA VF FD GA DG VA AD XF FG FD FD AX",
      "GD DA FD VA DA VF DF AD GG AF DD DG XD AD AF FV GF GD AF FG FD GG GA GG FX DG VA AG DA FA XF DF FA XA VG XD XA XF GA FV FD GX FD DG FA FA GX GF AF AA GF GF FX GD GF DF AF AX AA GF GV FF XF VG GF GA DG FA FF GF DA DG AG DF GX XF FA XG GG GA VG DF DG DG DF FG VG XF XG GG FA XF DA FG AG FF FF AG FG AX GX FV FF AA FV GF AD AF GF AA GA FF XG FF VF AF VG VG XG XG AF FG FA FV FX AF FA XG DF FF DF VF VG VF FD AG XA XG AA AD AF VG DG DA AG XG DG XA XD AX FA FD XF DG AF AG FF FD FD FG FA DF XF GV GD DG DA DV FF DD DV AD GF AF FX DX FG GF GD AX GV DF AF GA FD FD AD XG XA XA FF AF FG AF FG AD AF XA XF DD VG AA DD GD AV GD FD GA FD AD FF DG XF VF FD XA AF XA DG FF XG DF FD FA AX FD GG GA FG DF DA AG DG DD DG VV AF X",
      "FA FF FG GG VG FG GG XA VG DF XG XF AA FA FA FA XF XA AG VF XF FG AG XG VG GF GG AG AF XF FD GD VG DF FG VA DF VF XA FF VA VA FA AA FF DF DV DG GD AF FX GV GF DG DV VD GF GV AF FF AF AG FA AF AD GF FG DG GD XG AG AD AF DA DA AG GA GD GX FA GV AD DA AD DG AD DF DA DD GD FA AD GD FX FD DV AD FF AV AA FF AV FD GA GA GD FF DD AD FA FA AD FG DA GG AG DG FA DF AG DG FA AF FA GD DF GF FA AA GA DD VD DG FF AG FA XD DD FG FF AG XG AF AA DF AG VF DD VG VG GG GG VA GF FA DV FF AX VD DX GD DD GD FF GX GX GF AA GV AA FD GF AF AF AD DA GV DA AA AF AF GV GF FD GD AG AA GA FG FF FF GF AX FF FX GD VD AX VG FG GA XD AG DF DF FA AD AA XX",
      "XG VA VF VF GA AD XD FF DF DD AD VG FV GD GD FD GX FX FF VF GX AX AA VG VD AA FF VF FD DF GD VA DD FA XA FF GD GD GG FX DA DG DA FV AA GD AF DX DF FA AD AF AD AA GA AF AA AD AF DA FA FA AA DA GA DG DF VG GX FF VA FA DG FG FF DD GA AG VA FF AD XA VA GA FA GG FG AD FF FF DD AD FX AF FG AD FD FA DX GF AA GG DD GG AF XG FG XF AD DD XA FG DD FF GX AF AA AG AG FA VF FG AG FF FF FG VG DG GF FF DA VV XF DA XA XA FF FA DA AG XA DA VF DA FA VG GA GA DG VX AX DV DF FG GV GV GG GG GF FF AX DA AF FA AF AG DV GV FD GX FV FF XF DG FF FF VG VD DF DA DG FA FG FG AV AD GX GG AF GD FA AF AF VD DF XA VG VF FG GA DF AV VF DD VA FG FV AG AF DD AF GF FA AA FG AD FA XG X",
      "GF XD AA GA AA FV FV FA FG XG XF AD AA AF GF FD DA FD GX AD FX VA FA FA VF GG AA AA AA FA VG XV GD FF FF FV GD FD AA AD DA GF GA AA FF DD DF DX VA GA DF VF FF AD FG AG FF XA FF DF DG FD DX XD AG DF XF FG DF FA AG FF AF XF FG GF XF GA DG VG XA XG DF FX AX GA GD GA GF DD AF GF FX GF XF VG VF VG DF AD FG AD VV FV DX XA VF AF FA FA DA DD DF DG DD DA DG DF GD GD AG DG AD VF AF DX VD DG FG DF XD DA GD FF DG FA XA AD GD FA AX VV GX DX DD GD GX GG AF GX GG DF FF FF GX GD FF XA DG VF VA FA FG FF XG DG FD XF AG GA FA AF GA GD GA AD AA AF XF FG FF AF FA XG AF XG XG FF FX DA DD GF AF FF FF DA FF DF DA X",
      "FG VD GG FD FA FA VD DF DG VG AG DA XF FF AD AF AA FV FV GF FX AA GX FX DX VG DF XG FF AD DD FG VD DA VF FA XG XV FF FV GV GV GX AG GA DF AG GX FV AX AX DF AD GA DF DV GF FF FF FV AA AD VD AG FA AG VF AF FF DD XG GF AD DA FX AA VF DF AF AA DD AG XG DF AV VA XA XG FA FF FA VF XF AA XV FF VA AG DV XX FG AX GA GX FF AX AV FD FD AA FV FV XF AA DF FF FG XG VA AF FA VD AD VA GX VG AD GF AG FF FG AD FF FA AF VF GD AD DG VG AG DD VF VF XA DG AG FF FF VX XA AF FA DA XG DA VF DG AG FF GF FF XA AD AV DD GD AD DD AF AF DX GF AV FX AA DD GD FA DF DV GD AD DX FG AG GV XG VG XA AA DA DF DA AG VA AF FD AA FF AV DV FX AA GF GF DV DA GD AF FV DF XG VG FG FA VA AG DA FD AG FG DA XF XX DG DG DG FF AG DA VG XG VD DF XA FA X",
      "XA GG FF GF AA VA FG DG AG VG AG AA DG GD AF GF FD AA FX GX AX FV FF XG VG AV AG FG FF FA FG XD DD AA GA FF AF AF FG GF AF AX FF AF GD AG DV FG FD AD DF DV AF FF FG AD VG FV XF GG GD AV FA VD FG VA DF DA XA DA VV FA FA FF FA FG FA VG AA AD AF VA GA GG FX DF GF GA AV GV GV GA FV FV DA AG AA FA DG AA DD FD XF VA DX FA GD AA VA AG XD DD FA FA DA VF DA AD FA XG FF VF AG VD FA DD XA FA AF FA DG GF FA GD XG GD DX GD DF GD FA GA GX GD GF FD DG AF GV GA GX DD AF FD GD AF DD XV AF DG FD XF VF VF XA FA GD XF FD FD FD AD FA GF FA AF GX GF XA FG VA DF FD DD DF VA DG DF DF GG AA FD VD FG VA XF AG DG FD X"
    ],
    "key": "THISPASSWORDISVERYS",
    "lengths": [
      19
    ],
    "alphabet": "UBIDEZGHCJKLMNOPQRSTAVWXYF0123456789",
    "results": []
  },
  "5": {
    "plaintexts": [
      "IN THE COURSE OF STUDYING CLASSICAL CIPHERS WE RAN EXTENSIVE EXPERIMENTS WITH COLUMNAR TRANSPOSITIONS AND POLYBIUS FRACTIONATION. THE GOAL WAS TO EVALUATE RECOVERY RATES WHEN MULTIPLE MESSAGES SHARE THE SAME TRANSPOSITION KEY AND TO MEASURE HOW HILL-CLIMBING STRATEGIES PERFORM ON REALISTIC LENGTHS.",
      "THIS TEST MESSAGE IS INTENTIONALLY LONGER AND INCLUDES VARIED PHRASES TO STRESS THE BREAKER: IT CONTAINS REDUNDANCIES, COMMON WORDS, AND REPETITIONS THAT SHOULD HELP INDEX-OF-COINCIDENCE BASED SCORING. THE MESSAGE ALSO MIMICS NATURAL LANGUAGE STRUCTURE SO THE POLYBIUS MAPPING YIELDS REALISTIC FRACTIONATED STREAMS.",
      "ANOTHER LONG PLAINTEXT IS PROVIDED TO ENSURE THE ALGORITHM SEES DIFFERENT CONTEXTS. IT TALKS ABOUT ALGORITHMIC BEHAVIOUR, RANDOM RESTARTS, AND HEURISTIC SEARCH. REPEATED PATTERNS LIKE THE WORD 'THE' OR COMMON SEQUENCES WILL INFLUENCE BIGRAM AND TETRAGRAM STATISTICS AND THEREBY AID KEY RECOVERY.",
      "TO FURTHER DIVERSIFY THE DATA SET THIS EXAMPLE INCLUDES A MIX OF SHORT AND LONG SENTENCES, SOME REPETITION, AND SOME UNIQUE PHRASES. THE INTENT IS TO PRODUCE A FRAGMENTED YET CORRELATED FRACTIONATED STREAM ACROSS MESSAGES WHICH IS TYPICAL FOR PRACTICAL ADFGVX USAGE IN EXERCISES.",
      "FINALLY THIS MESSAGE CLOSES THE TEST SUITE WITH A COMPREHENSIVE PARAGRAPH THAT MENTIONS CRYPTOGRAPHIC ANALYSIS, IMPLEMENTATION DETAILS, AND THE IMPORTANCE OF ROBUST SCORING FUNCTIONS. THE LENGTH ENSURES SUFFICIENT STATISTICAL SIGNAL FOR THE HILL-CLIMBER AND OPTIONAL ANNEALING STAGE.",
      "AS PART OF A LARGER EVALUATION WE PRODUCED SEVERAL LONG PARAGRAPHS INTENDED TO STRESS THE TRANSPOSITION BREAKER. THESE TEXTS CONTAIN REPETITIONS, COMMON PHRASES, AND NATURAL LANGUAGE PATTERNS SO THAT BIGRAM AND TETRAGRAM STATISTICS ARE REALISTIC FOR THE POLYBIUS MAPPING.",
      "TO ANALYSE ROBUSTNESS AGAINST LOCAL OPTIMA WE COMPOSED MESSAGES WITH VARIED REPETITION LEVELS AND SYNTACTIC STRUCTURES. THIS ALLOWS RANDOM RESTARTS AND ANNEALING PROCEDURES TO BE TESTED AGAINST BOTH HIGHLY REDUNDANT AND HIGHLY DIVERSE STREAMS.",
      "MULTIPLE SHORTER MESSAGES WERE MIXED WITH LONGER ONES TO AVOID ALIGNMENT BIASES AND TO PROVIDE INDEPENDENT SAMPLES FOR EACH COLUMN. THE MIX OF LENGTHS HELPS REDUCE PADDING ARTIFACTS AND GIVES A MORE STABLE INDEX-OF-COINCIDENCE SIGNAL ACROSS CANDIDATE KEYS.",
      "EXPERIMENTS INCLUDED TEXTS THAT EMPHASISE COMMON STOPWORDS, NUMERIC PHRASES AND DOMAIN-PECULIAR VOCABULARY SO THAT THE SCORE FUNCTION FAVOURS TRULY LINGUISTIC STRUCTURE RATHER THAN ARTIFACTS ARISING FROM THE FRACTIONATION.",
      "WE ALSO GENERATED MESSAGES WITH BLOCK-ORIENTED PATTERNS TO SIMULATE SITUATIONS WHERE SOME COLUMNS SHARE SIMILAR CONTENT. THESE BLOCKED SEQUENCES ALLOW TESTS OF BLOCK-RECONSTRUCTION STRATEGIES AND HELP MEASURE HOW MANY SAMPLES PER COLUMN ARE NEEDED FOR RELIABLE RECOVERY.",
      "FOR REPRODUCIBILITY AND DIAGNOSTICS EACH MESSAGE VARIATION IS TAGGED IN THE EXPERIMENT LOGS; THIS MAKES IT EASY TO REPLAY SEED GENERATION, CONTROL RNG SEEDS, AND INVESTIGATE WHY PARTICULAR CANDIDATES REACHED OR FAILED THE IC THRESHOLD."
    ],
    "ciphertexts": [
      "GG DF DF GD GG GG GD FF DD DG FG DD FG DG DF FG DG GD DF GA FG GG AG FF FF AD DG DD DG GG FF FG AG FF FG FD FX GF GF DF GD DF DF DA FG FF DG FF GF GD DD DD GD GF FG XG FG FF FA GG DG FF FV GF DF FD GF GG GF DF GF GG FF GF DF VD FD DG GF DD GF FD GF GF DG GG DD FG GF FG GV GF FX XF AD DA DX XX AG XF FX XX XA VX AX GX GG AF XX DV XX XA GF XA FD AV GX AV FA VF DV GF AG GA XA VF XG DX AG XF VG GF DF GF FF GG GD FD GG FD DF FF GG GF FG FF GG GX XA AG FA XX XG GD AV DG XA VX XD XX XX AX DG FG GD XF AA DV VV AD XD XA AX XD AG GV FG AV GX XX VX XV AX DD FG GX VA FX XD AF DX AV GX GX GF XV DA GD FV XX VA FX GV XF DA FG GA XA VD FA FX XG XX DA XA GA AF AA GD DA DF AX FV XF GD XF FF DA FD AX XA GX DX DG DD DA XD VF XX AX XF FG FG GG FD GD DV GG GF DF AF GF DD FF VG GA DD FF GX",
      "DD GG FF FF DD GF DG GG GG FF GF GV GF FG FG GG GG FD DV FF FG FF VG VF FG FF DF FG FF GA FA FG GG GG FF FD GD VG FX DF GG GG FD DF DF FG GV DG FF FG DF GD GF GG FA DG FF DG XF GG DA DG GF FA GG GF DV DD VV GF FD DG DD FF DF GF GG FX GG FG FG VG GG FD GV FF FG DF GG GF FG GD GD GF GA GF FD XX AA AA FA DX AG XD AD AD AG VX FG DD GF DV VX VD XV DG XX AG XV XF GD AG XX AF XG XX VF FX XA AA AV GX GF FA AF XD XG DD DG GD FF DD GG FG FG FF DV VF GG FF DD FD AD FG DD DX FX AF VA AX XX DX AA FX DF XG XA XF GG FX AX XX DV XF XX XG DF XV GV FA DX FF AA AA XG AA FF AX GD GG AD DA GD FF AX AA FX XA XA AA XF AG XD XX AX DF XX XX DV GD AV GF GD AD XX GX GG AF GX XV AX FD AX AX DD AA FX VF GG FX XD VF GX GX XX XA VD VD GX XD GV XA AF GV AX AA GA XA VX VX VA AX XA AF GG FG FD FF FG DV GF DD DG GF GG GF FF FG DF GG VF FG GX",
      "DF GF GG FG VF FF FG DG DV DF DG GV FA DF GV FG GA AF DG GF FD FG FD DF FA GG DG FG DF GG FG FG DD FG FG FX FD AD GF GF GG DG GG FF FF GD DF DF GF GF GF DF GV FX GF GD VF GF VF GD GG GV DF GF GF DD GG GG GD DF VA FA FG DF DG FG GG DA FF FF FG FF VG FF GG FG FG GD DD GX GD DF XG FA XX GV FX DD AD XD GV AX AF FF DD XF XA XX DG FA AG GF XX VG GG GA AA DG XV DF XA DX AG XG XX XX GF DG GG DV GA FD DF FG DG DG DG FF FG GG DD DF FD DX XA XD XX XX XA XX XF XX DX FD AA GG DX VX DX DX XG XX AX AD AD GA DX FG GF FA GG FG XD XX DV FV GX GA AV DV XG XX XX DX DX XX DX VD XV AX DA XX XA VA GX AF GF FX XV XF AX XA AD VX XG DX GF GX XF XD AX AX GG GA DV FX GV FA XV VD DF AA VD FA XA XF XX XA XA AV FA DF AX VD FD GV FD FG DD DD FD DF GF FD DD FF GF VA GG DD GG GX",
      "DG FV DG FG FG GG DF AF GD FG GF DD DF GG DD DF AF GG AD FG GV GG FD GG DD GF VD FG GF FF FA FG GG FX FD DF GG FF VG FG DG FF DF FG FV FD FF GD FF DG GX FF GD FD GA DG FF GF GG DF GG DD FG GG FF FF VD GX VV VD GF VF DF GG FG GF GD DG FD DV DG DD VD VG FX DF XA XF AA AA AX GV GG XX DX DA XX DA FD DF FF FX GD XX GF DX XX DF AF GF AV GV XD GX AG GF DV VX XX DG FG AG DF FD FD GG FG GV DV FV GF FD FG DD AG FX DA DX FV AX GA XX XD XA XD GA FX XA GX AX DX DG DX XD FG GD VD XG FD FX VX XX XX XG FX DD AA VF AG XX VF VG AX XD AX AD AX DX AD DX XX FA FA GV XF GX FX XX GX DA GG VX XX AA DX FA GA DD AD XG FF DG DA AX XX AA XD VF DA AX XA AA AX FD XV GX GA XF GG GA DA FF GD DF GF FG GG VG DG FG GA GF DG FG FF FF GG GX",
      "VD FF GG FG FD DA DF DD DV FF DG FG FV DD GD FD FG DD FG DF DF DF DG FF GG FF GD FF GD DG FD DF FG FF GG FG FF GF GG DG FG DF GG FG GA FF FF FG DF VG AD DG XG FD GF DG FD FG DF AF DD DF VF VG GG VF GG FF GG DD GG GF DG DG GD FD GF GG GF DF FG FG FG DF DG GV DF GV DF GV GX XG DA GG AX AA FA XD FG GA FX VD FX DG AX VA XX XF XG GA DG GD XX AD XA AF VA VA AF DV DF AA XF GF GG DF DD GF FG GG VD GF GG DG GF GG FF FG DG GX AF GA XF DF GG XX FA XF FG XD FV AG DF XF GX FA GV GF GG XA AD AG GF DG VV XG XD DA DA AV DA FA GV AA GG GA XX AX DF DX AX FF DX VX GX XA XX XF GG VG DX VF XV XV XF GG DD XF DA FA AG DF VF XX XA XF AX VX XA GX DX AA XX XA DX XV DV DG XA XX XG XX AD XX GX FG XX XA FF DD FG DF GF DD GD GG DG FG GF GG GF GF FF GG FX",
      "DV FD FF FD GV FD DD FF FG GF DD DF AG GD DG FA DD DD GG GG DG FF DG FG DG FD DF GD DF GG DF GG GG FF FD FF DD GD GF AD AD DF FG DD GF DD FG GF DF GF DG GF GF GG DF GG DG FG FF GD GD FG VF GF FD AD DF DF VD GF DF DF FG DG DG GF GG DF GD DF GD FG GD DV AF DD DA XX XX XD GX FG AG GX GG XA FX FD AG XX GD AV DA XX DF XX AA XD GA VX AX GG GA VX VG XD GG GG DD FV FD FF FD GG FF VF GF DG FD FD VF GX DV FX AF AD XX XA XX XA DA AA VG XX GX GA XX GF FA GX FX XX GA XA AF VX XX XX XX AG AF AD FD AX XD GG GA VX GG XA GD AD XX XA DG DV XX DX DX DF XV AX GV XX GG GA DX AD GX FF XD AV GD GD DX FG DX DX GD DX DA VG FA AG XG AF DF DA GG DA XA GX GF DV DF GD DV FF FG GF GG GF GD GD GF GG DD DD FF FF DX",
      "DF DD FG DF GG GD FG DG FF FG FG GD DA DG DF GF FF FG GG DG FF DD GF GD VG GF GF GV DF FG DA FD DF VG DD GD DF FF VD DG VA VD GG GA GF FG GG DD FF DV DG AF GF FG DD FF FG FF GG GG DF GG FD FD FF GF GF FD DF GF FD DG FG DF FD GX AX DF AX GD AG GD AV AG GA AX AX GV AV XA VA GX FD XA FX XA XF GA DX AD DX GX VA GF XX FG DF DF GF FG FG FG DF FF GG GG DA FG VV FX GD XA VA AG GD FV AA DG GA AV FX XA GX XG DG XX AF GG XA XA XX VF VA DX GG XA AF GD AG XX AX AA XX XG FX XA XX XV AX AF XX XA FA GV AD VV GV XX DA DX VA FV XX XD AG VX GX GA AA AX XA XG FD DA FX FF AF XF AD AX DX XG XV GF FD AF GF GG GD GD GV DF FD GD GD FD GF FV FG DX",
      "GG FG GF FD GG VG DF VF FF FV VG GD DG GG DD GD FF GV GF VG GD GV DG GG GD GG FG FG VV GF GA GF FF DG DD GF FG GF DG AD FD DD DG GF GG FV FG FG FA FG FG DD VG DF FG GG GG VV GA AF FF GD FF GD GF GG GF FG GG FF GG FF GD GF FF GG FV GF DA DA GX GA AD AX VG DD XA DG XF XF FX AA AA VX GD XD GF XA FX XA GX DA XA XG AX AF FV FX XD DD GG GF FD DF VG GF GF FF DF FG FG FG DF DX VG XA XX XF DA XX AD DV DA VF AG GX VX FF DA XV AD AD VA XA GX AX GX XX XX VF DA DX DF AF AV XX AX AA AA XX DF AD XV FG DX GF FD XD AG XF VD XG XF XX VX GX AA XF AX GD GD AX AA XA GA GX DX DX FG XF GF AF DA DF GV GA AF AG GX AX GG XF GG GD FD GA GD GD FF DV FG VD DF DV GF FF DX",
      "GG FA GF GF FF FF FF DF GG AF GD DD FG FG GF GD FF FG DD GG AF GG VD GF GG FF GG FX FG VF DG DG FG GD GD FG DF GF FF DD VV GX AG GD GG FV GG GG FA DG FF FD FD GF GD DF DD VF DF DF FF DF DF FV GF GG DF DD GF GG DF AG GD DV GA AG VX AA GD GA DD XG DD AX DF XX FX XX GA XF GG XX XV FD DG DF XG XX GG DD FG DG FV DF FF FF DG GD GD GF FF DX DX AA DF XA FA GV GA GD AA FF XG GX AG FA DA VX DX AA FX DV FV XX XD VX FX AF FX XX XA XX GX XA DG FF XX XV DX AF VX DA GX XX FA XG AD AD DA DD VG FF FV VX XX FD DD GX XX VD XA AD DA XF XD XD FV VA VG GG AD FF GF GD GF FG DV GD DD FD FF GF FF VG FD DX",
      "DG VG FG DF DD GF FG GG DG FF DD GG FF GD FF VG FF FF GD GF GG GF GF DG AF GD AF FF FD GA FG GF FG FD FD FV GG DF FG GF DF GF GF FD DD GF FD GG FG FG GG FF GD FG GF FF GD FG GF FF FF GG GD FF GV DF DG GD FD GG FF GF DF GG VF DV GG DG FF GG FG FA DA GA XX AA VX AX DX DX VX AX VX XG GD GA DD XD XD GX GX FG XG GG XA FX GF VV XF AX XA GA DD GX VX XF DD FF DF FG DG GF FD FA DF FG GD GG FD GG VG FA GX XA FX XF AX XV GV XX AF AD XV XX VD AX VA XX FX AD AX AX AX FD XG FX AX AX XD DA FX VG VX XD GX VD AF VX DD FA AV DG AX AX XX FF DA DX VA VX DV XX XG GD DA VV AD AA FX XA GA XA FX AX XG XA AX DV AX AX VX XX XX XF AD AX VX VA VX AG GA DD FD AF FG GG AG DD DD FG FG FF FG FD FF FG VD DG FD GF GX",
      "VF FV DF GG GF GG DD DV DD FV GA GV FF VF VF FA GF FF GV AG FF DA GG FV DD FF DF DG FX GG DG GF GF GD DG GF FG FF FG GD FD FG GF XF VG GG GD FG GG FD FF GG FG GG DF GG FD FX FG DD FG DG GG GD GA DG FF GG DD DV DV FG XX FG AX AF AF DX FF XA XF DA XX XF XG FF GX DF AA FG XG XD XD XX XG AG AX GF AA AX XV XD AG FD DD DG GF FD FG FF GD FD GD GG FF FX DV XG FX GA XX XX XV GX XX XA GG GA GD GX XX AF FF DF XG XD AV AV GF DX FG DV FX DX DX DF VG AA DF AD AG AX VA AV AF XD DG FG XA XD XA XG GG XA XV AX DX DX AG AA FG XX VF XX DX VA XG XF GG FG GG DA XX AA FV VA DX AG AF GV FF GD DD FF GG GG DG GG DF FG FV GD FX"
    ],
    "key": "AVENIMANAILUYI",
    "lengths": [
      14
    ],
    "alphabet": "QXZJYBWPVAKTSRCHLONMIGUEDF0123456789",
    "results": []
  },
  "6": {
    "plaintexts": [
      "Dein Laecheln traegt die Waerme des Morgens in sich. Wenn du sprichst, verwandelt sich jede Stille in Musik. Du bist das Licht, das selbst an dunklen Tagen bleibt, das Herz still beruehrt und die Welt in sanfte Farben taucht.",
      "In deinen Augen liegt eine Ruhe, die mich traegt, wenn alles andere vergeht. Sie sind wie klare Sterne in einer endlosen Nacht. Ich verliere mich in ihnen und finde jedes Mal ein neues Zuhause fuer meine Seele.",
      "Mit dir fuehlt sich jeder Moment nach Heimat an. Kein Ort kann so echt sein wie deine Naehe, kein Traum so lebendig wie dein Blick. In dir finde ich Frieden, Staerke und dieses seltene Gefuehl, ganz angekommen zu sein.",
      "Deine Stimme klingt wie Wind durch die Baeume, sanft und doch stark. In deinem Lachen wohnt ein ganzer Sommer, der nicht vergeht. Ich trage deine Worte in mir, als waeren sie geschrieben in das Herz der Zeit.",
      "dein Name klingt wie ein Gedicht aus Licht und Leben. Du bist kein Traum, der vergeht, sondern Wirklichkeit, die bleibt. In dir beginnt jeder neue Tag mit Hoffnung, Liebe und dem Wunsch, ewig bei dir zu sein."
    ],
    "ciphertexts": [
      "AV FF AX GD DV DG DF DX GD DV GX AX AD AD FV DD GD DF GD DV DV AD DG GX GD GD DD AF DX GV FA GA GD AA FG AD AF AV DF AG GX AD AF AV AA DD AX GV DA GF GD AD AD AD GA AD DD AV AV AG DV GG AF GF AD FA AA FF AD FF XF DF AD VF DA FG DG DA AF DD DD VA DG VG AD AX FF AG GG DD FF GG GD DF AX DG DD FD FA VA VF FG DA AA VD DD VA DD DG XF VF XA VD DG GA FA FG DA XD AA AF VA GG VG VA DG DD AA AG DG AF FG FA GG XG DA AD FA XA AD DG GF FF VF GA DD AA AA AD AA VD DD FA DX GA XA VD AF FF XA XG FD AA XF DV AG VG XA AD DA FD FX AV DF GA DD GV AA FX FF FV GX",
      "DV DF AD GX FV DV AV AD DV DD AA FF GD AF DX FD FD AA GX AV GD FA DG AX AF FV DA GF DV AD FF DV DX AD DF FX AV GA AV FD DD DD AV AD FX FF DD GX FF AA AD AV AD AV AX FA GD AD FD FF AV DD DD GD FA FA DD FD DA XA FG FA VD XA DD GD AA VD FV AD AA DG DV AA FV FF DF AF AF VV DX GG VF VA DA GG GF DA FD VF FA GD FG XA DA FA FF VG VG DA XF XA GA DF VA VA VG VD AG AA DF VD VA VF AG XD DA VA VG AA DF VA FG XA AG VG DF DA FD VF VF DA FA FF XF GG VA XD FD VD GA DF FG GF DD FA AD DV DD DV AA DD AD FF AD FD GD GX FV",
      "FX DV GV DD AF DD FX DF DF AD AV GX FV GA DD FA DF DG FF VF VA XD VA DA AA DF AD DX AA DD FD GV AF GD AF FF AV AA DX DV FD FA XF FA VA DF VA VG DF DF AG AA FV FG GV DA AA DD DV AV GA DA AG DD FV FV AA AF GV AD AF GA AD FA AG AX AG FG AA DA FD FD AV DD FA AG AD FG AF AF AX DV AA AD XD DD FD AF FD DV AF AF DG AF AD GD DD FV FA FF DF VA FG DD DA VA DA XG FA VA DF AG DG FF GD FD AD DA FV DF DV AG GV DD AF XG GF DF XF VA VG FD VD XD VD FD VA VV XA GF FD DV DV FF AX AA FF FX GV GD GD FF AA AD AD GF DV DD DF DV DD FV AX AD DD X",
      "AD DV FA AG AV AD AF FG DA GD GA DD AD FA GD AF GF DV FV AV AA GV GX FA AG AD AV GG DA GD FA GF FX DV FF AD AV AD AX AF FV AD FG FF DD FA FV AV FA AF FF FV DA DF DV AF DD AD VA DX DG FF AV DD VF VD VA FA FG DD VF XA DD XF VD VG AG VX GV DG AV FA AX FD GG GD AD DX FA AA FX FF AF DG XA VA VA DA FD DA XF VD FA DG VF DD FA DF XF DG DF DF FA FD DA XF XD DA DA GF DD FF DD VF FA DD DA XA VA GX AD FG VG DG GA FD AA DG DA FG DA VD XX GD FG XA DA DD FF DF XA FA VF VD DD VA GX AF AA AD AD DA FV GD DV FA GF FD VX",
      "AA GD GF AA FG AG DV DD DG GD DF GV DF FX AG GF FD AG GD AG AX GD FX AG AA GX FF AF DD AV GV FV DF GA DV DD AV DV GX AV GA AD AF GV DV DF AG FV AF DD FF FD DV DV GD AA FX GX DD DF FX DX DG GA VX DF VA XA GA FF FD DA DA GG FG AF DD AX AD DF DG GV FX FF DV DV AF GF AA AF AX FD FA FG VG XG DF FA FF DF AA FA AA DX VD VA DG AG DF DF XG VD DF DA XA DD XX DD VD AF DD DA AG FD AA DA AF VA FA FX DD FD FD FD AD DF VA FD VA DF VG VA VX GA DD DD VD DA VA VD XA FA DF AF FD FF FA FD AX AF AA AX AA FA AV DD GV GG DX"
    ],
    "key": "AVENIMANAILUY",
    "lengths": [
      12,
      13,
      14
    ],
    "alphabet": "BACDEFGHIJKLMNOPQRSTUVWXYZ0123456789",
    "language": "DE",
    "results": [
      {
        "length": 6,
        "key": "DAFCBE",
        "score": 0.04525056943917936,
        "recovered_plaintexts": [
          "INTHECOURSEOFSTUDYINGCLASSICALCIPHERSWERANEXTENSIVEEXPERIMENTSWITHCOLUMNARTRANSPOSITIONSANDPOLYBIUSFRACTIONATIONTHEGOALWASTOEVALUATERECOVERYRATESWHENMULTIPLEMESSAGESSHARETHESAMETRANSPOSITIONKEYANDTOMEASUREHOWHILLCLIMBINGSTRATEGIESPERFORMONREALISTICLENGTHS",
          "THISTESTMESSAGEISINTENTIONALLYLONGERANDINCLUDESVARIEDPHRASESTOSTRESSTHEBREAKERITCONTAINSREDUNDANCIESCOMMONWORDSANDREPETITIONSTHATSHOULDHELPINDEXOFCOINCIDENCEBASEDSCORINGTHEMESSAGEALSOMIMICSNATURALLANGUAGESTRUCTURESOTHEPOLYBIUSMAPPINGYIELDSREALISTICFRACTIONATEDSTREAMS",
          "ANOTHERLONGPLAINTEXTISPROVIDEDTOENSURETHEALGORITHMSEESDIFFERENTCONTEXTSITTALKSABOUTALGORITHMICBEHAVIOURRANDOMRESTARTSANDHEURISTICSEARCHREPEATEDPATTERNSLIKETHEWORDTHEORCOMMONSEQUENCESWILLINFLUENCEBIGRAMANDTETRAGRAMSTATISTICSANDTHEREBYAIDKEYRECOVERY",
          "TOFURTHERDIVERSIFYTHEDATASETTHISEXAMPLEINCLUDESAMIXOFSHORTANDLONGSENTENCESSOMEREPETITIONANDSOMEUNIQUEPHRASESTHEINTENTISTOPRODUCEAFRAGMENTEDYETCORRELATEDFRACTIONATEDSTREAMACROSSMESSAGESWHICHISTYPICALFORPRACTICALADFGVXUSAGEINEXERCISES",
          "FINALLYTHISMESSAGECLOSESTHETESTSUITEWITHACOMPREHENSIVEPARAGRAPHTHATMENTIONSCRYPTOGRAPHICANALYSISIMPLEMENTATIONDETAILSANDTHEIMPORTANCEOFROBUSTSCORINGFUNCTIONSTHELENGTHENSURESSUFFICIENTSTATISTICALSIGNALFORTHEHILLCLIMBERANDOPTIONALANNEALINGSTAGE"
        ]
      },
      {
        "length": 10,
        "key": "JCFBIAEHDG",
        "score": 0.04078482420260829,
        "recovered_plaintexts": [
          "UIOJNNKNIGIMONDVSBKNHBLAPHXI9UUHIATDAOZGITS5PUA6ICDCCZOUH5TP0T4AIUMLIWSD8YGPBEGIGGC5VNEQUGMEEA1URSCNAXAZZIGUIBDBC2TDXOZIPEHD4PQX6BSWBEGSUGCOGICQ0IWS3YBCDKHTIXH5CKOYGVAXNVHDUL5GMOK6GUA53JOTMCGDWNHVENAMDANGBGMOE5SAAAIOAN7XNOL6POOOIRBMFKKUCNATCVYOAMDWHMISOL8",
          "I45DBBBG0SPXYVPVSKH1BWTYUPBCGABBNQGSLHA1IMOGHSOFHNDN99III40TGL5NCCHIZDIA98NBGQNUCINNSICKKDIBACVPAY0JBIAOJCSHMHASSJCIVTDBVTXCDPIK0IUPUAIBKUNHTITO4IOMJMDFJ9ZBTP5HOACFIGEMCPGAMHCGTTP4SNX6VCMNN4OOF10NDQ6QBMAN4GANABGSNW2ONSA0OGCZ2JWACIDUDGHSIVBMBMON5VBIHRBMONJCPWIOJAEWP",
          "DEZCCVM5AGJ29HMG5ZOBOC35SDTASJCOF4NPOSLANIILUBQDHDPWAZOUWHRISOFOCOCNZBDXLMGHNL0MGMZHNDLKUNDH1H5BN96ICLQ8GBF616SB50BPAN5JGAHIIDBL8IDVHAVMWCGVGSX11NIXIPOENBBPWU6YOJAHYPMONAUIXPMHBANBPIBJ1VIGHQBNLZ0GMNIKBNAHOOULK1DNAPCDBMQKBGRI0VPFGFHVW4IGSWCDBOHUQ",
          "S1HQBM5OGGDFAEHV9D0UIW2PGCXIZJUHH9ODAJYAJENLGBH5HIPT6IDBCLBUIBPTBNW6UJOH9YSUS88BOOGDDDIOI4CG5CMOCNN7MR16ZVP5INYIQW8DUQJ4PAENGDMIGICCRWBDBE5GGAHABBQA5HBOVF7MBSCHMSTAOOPCZBSCHQNVPME7GPTWRSWUIHCGKQ9VVC5DPSOLGBHCIGMBIUEOILTAUMMB2DMN2H",
          "NLL5CJGHOVBZBDPICOZCIBEGTN2HKIBH6LHMAGLJTBH5BPE5HOWUNKNIU0CPMWK4GHSTGPOHOOHQT9NGPHKCDOO6N7ONDMPVCH44AH5PHGOHMBBCHHCDBT6AMXUD5SVUZYINJMIJNGD0BAD8BSQIPJSIAHODMSIGCBURBOCLMZVTE5JJHNCTIIC5HHDQ6FGBUZTJOA5GODH5BCGOEKJDIHIGVNN4AGWRKDPRG4MBOLIJCSIK"
        ]
      },
      {
        "length": 9,
        "key": "ADBCEFIHG",
        "score": 0.040265729455221486,
        "recovered_plaintexts": [
          "N70QHTNUHNI1BBZQIJ6GDHI0XCCMGAE6TGIIABM1I7QDMMAIOAGNVZC10NR2UAR27GTWLTA9RB6I2GCDN14MCG8MNBLYIT02GMJMOBTOIXWNIZ4V3CAV5FMHM4KSA5PGPRGPTIHUDJXRIAMAPMHGLDOBNOZVBO5MOSHBUMAHNVT0ICSNIDZNGOBHO4MMTGNJSN1DBK9UPSIGMHV8PAGNTTAWBNAIQJMNWQGMV6HPBQ3OGGGVGPSBPUPGCGC",
          "JBBQSLQTGACBNQICDQGIMBCCNTBG66AZHXOINGCT3GMBO9NIQGOOB4KD7TIHUN35OZTWMFSUGAPGW7MHPJJUAM6BAPKU0BHQBM4FMGLACBA884MNKZNS4QIPCIKHMRHGTHMNFDAXGDQJMPJENOTAGPVPTCDAJZABMU8BJANTUIU5BOJE2OAVHPJITOAVIGDJCMGMUANEHOH7TMOWGBJVOGTXQECOI7HOFOUTIQMJBAZVSUSBDGOEBHVLOOMDCDJBQJTNABMMD",
          "LMGJTIRS25PAUN8HNE4YZGNKTCP5PACMIFG2P6IRPTCO9KBOENRUU14GISZZTDC87ZPLFAMHIBJGQAHTAWIOAFMUMB2UGC6KTBLIC4AH0GDZG1VN9KSH0KSNFIBEMM5M7RRBMN5IPUOOCUOHGGMNOGTCK6HMMT6DJUDGTJG4CIO5ACVZJPBAHSOIFYUBVINJMMPNMB8SOARPTSH2BDUKIMTDJTDHKIBBDFSBUK5JCNKCTYO1PBTLOG1",
          "IIOC65HDHK0VG7NRM13IBTC6XMMHCCG1KMSAGGAQZGWSHMMPH3ISIGXDSO0ITJ666ORWDXMHCMGC66AC4IGTR5GDP5XMBZNBQSMZG0RKKXGOYMBECBFM88CVIWJVMOIPGBNJBUHSSBOM2NCCICVT01SDDLBBJGZJVSHAHD0IVJAZAQNIBHBNPCGP6SBOUQTMTL7IBABMGCZIVJESMDTZPIGI9VCC3GBCN1SAV9G6XO",
          "6GANH5KNLACMFIEYABYP7LACOIQR0HAMYTCGHHMSZZCOMGG4SOISHK0G4RHIFTIMIZNX0XO5ZM4OCSBC2T4IN5DUVXJIPCHHNN5GJHAZKTM6NOHMC4HVGTBYLM6SNHTIAAOHQVTLPGVBPBSSMAAAX0SCGZSVSHGVTINSVGWJVATRCHJAJDAJHDIM0CIGPRHNGHJGAO0BID9OOMBMOBNGNMTO6AUAG4PCOIHMDIPIINAYDUK66GW"
        ]
      }
    ]
  },
  "7": {
    "plaintexts": [
      "Hallo. Gleich. Ende.",
      "Hallo. Anders. Ende."
    ],
    "ciphertexts": [
      "DD DA AD DD AF XA FV VA FA DA DF VD GD XX FD",
      "DA AA AD DF FF XD VV VA FA GA DF GA GD XD XD"
    ],
    "key": "MUSTER",
    "lengths": [
      6
    ],
    "alphabet": "BACDEFGHIJKLMNOPQRSTUVWXYZ0123456789",
    "language": "DE"
  },
  "8": {
    "plaintexts": [
      "I love Crpytography"
    ],
    "ciphertexts": [
      "FF VX AF XG AX GF GD AA DX DF AF VF FF VD GA FG DA DX"
    ],
    "key": "MATH",
    "lengths": [
      4
    ],
    "alphabet": "ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789",
    "language": "DE"
  },
  "9": {
    "plaintexts": [],
    "ciphertexts": []
  },
  "10": {
    "plaintexts": [],
    "ciphertexts": []
  },
  "11": {
    "plaintexts": [],
    "ciphertexts": []
  }
}